{"config": [{"config": {"output_mask_type": "raw", "output_mask": null, "mode": "concat", "concat_axis": -1, "arguments": {}, "layers": [{"config": [{"config": {"kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_42", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "activation": "relu", "use_bias": true, "batch_input_shape": [null, 14], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "units": 14, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"name": "dropout_29", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}], "class_name": "Sequential"}, {"config": [{"config": {"kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_43", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "activation": "relu", "use_bias": true, "batch_input_shape": [null, 843], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "units": 843, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"name": "dropout_30", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}], "class_name": "Sequential"}], "name": "merge_8", "output_shape_type": "raw", "mode_type": "raw", "dot_axes": -1, "output_shape": null}, "class_name": "Merge"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_44", "trainable": true, "activation": "sigmoid", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "activity_regularizer": null, "units": 70, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_45", "trainable": true, "activation": "sigmoid", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "activity_regularizer": null, "units": 843, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "backend": "theano", "keras_version": "2.0.1", "class_name": "Sequential"}