{"keras_version": "2.0.1", "backend": "theano", "config": [{"config": {"kernel_constraint": null, "kernel_size": [3, 3], "filters": 32, "trainable": true, "kernel_regularizer": null, "name": "conv2d_483", "padding": "valid", "use_bias": true, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 3, 299, 299], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_first", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "activation_489", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "data_format": "channels_first", "name": "max_pooling2d_33", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "kernel_size": [3, 3], "filters": 32, "trainable": true, "kernel_regularizer": null, "name": "conv2d_484", "use_bias": true, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_first", "bias_regularizer": null, "strides": [1, 1], "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"name": "activation_490", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "data_format": "channels_first", "name": "max_pooling2d_34", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "kernel_size": [3, 3], "filters": 64, "trainable": true, "kernel_regularizer": null, "name": "conv2d_485", "use_bias": true, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_first", "bias_regularizer": null, "strides": [1, 1], "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"name": "activation_491", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "data_format": "channels_first", "name": "max_pooling2d_35", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_9", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "units": 64, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_34", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_492", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_21", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "units": 3, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_35", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_493", "activation": "linear", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential"}